In [1]:
import pandas as pd

In [3]:
data = {
  "firstname": ["sara", "arash", "omid","abbass"],
  "age": [53, 46, 34,26]
}

df = pd.DataFrame(data)

df

  firstname  age
0      sara   53
1     arash   46
2      omid   34
3    abbass   26

In [4]:
for index, row in df.iterrows():
  print(index, row )

0 firstname    sara
age            53
Name: 0, dtype: object
1 firstname    arash
age             46
Name: 1, dtype: object
2 firstname    omid
age            34
Name: 2, dtype: object
3 firstname    abbass
age              26
Name: 3, dtype: object